In [1]:
import pandas as pd

In [81]:
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [56]:
new_df = df[['Pclass', 'Sex', 'Age', 'Survived']]

In [57]:
new_df.dropna(thresh=4, inplace=True) #lost 20% from the raw data

In [58]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 332 entries, 0 to 415
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    332 non-null    int64
 1   Sex       332 non-null    object
 2   Age       332 non-null    float64
 3   Survived  332 non-null    int64
dtypes: float64(1), int64(2), object(1)
memory usage: 13.0+ KB

In [59]:
X = new_df[['Pclass', 'Sex', 'Age']]
y = new_df.Survived

In [60]:
X.head()

   Pclass     Sex   Age
0       3    male  34.5
1       3  female  47.0
2       2    male  62.0
3       3    male  27.0
4       3  female  22.0

In [61]:
y.head()

0    0
1    1
2    0
3    0
4    1
Name: Survived, dtype: int64

In [63]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [64]:
X['Sex'] = le.fit_transform(X['Sex'])
X.head()

C:\Users\ASUS\AppData\Local\Temp/ipykernel_15052/626884136.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  X['Sex'] = le.fit_transform(X['Sex'])

   Pclass  Sex   Age
0       3    1  34.5
1       3    0  47.0
2       2    1  62.0
3       3    1  27.0
4       3    0  22.0

In [65]:
from sklearn.model_selection import train_test_split

In [66]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.1, random_state=10)

In [67]:
len(X_train)

298

In [68]:
len(X_test)

34

In [69]:
from sklearn.tree import DecisionTreeClassifier
model = DecisionTreeClassifier()

In [70]:
model.fit(X_train, y_train)

DecisionTreeClassifier()

In [72]:
model.score(X_train, y_train)

1.0

In [73]:
model.score(X_test, y_test)

1.0

In [76]:
model_2 = DecisionTreeClassifier(criterion='entropy')

In [77]:
model_2.fit(X_train, y_train)

DecisionTreeClassifier(criterion='entropy')

In [78]:
model_2.score(X_train, y_train)

1.0

In [79]:
model_2.score(X_test, y_test)

1.0